---
permalink: /
title: "ohters"
excerpt: "others"
author_profile: true
redirect_from: 
  - /others/
---

## keyboard

使用キーボード
- **Corne chocolate**: 42キー左右分割
- **Ergodox EZ**: 市販の左右分割
- **HHKB hybrid type-S**: ハッピーハッキングキーボード

**corne keymap**
```
# 基本レイヤー
      ------------------------------------------------------------------
      TAB          |  Q | W | E | R | T || Y | U | I | O | P           |¥
      -------------|----|---|---|---|---||---|---|---|---|-------------|-
      ESC(Control) |  A | S | D | F | G || H | J | K | L | LT(MOUSE,;) |'
      -------------|----|---|---|---|---||---|---|---|---|-------------|-
      Shift        |  Z | X | C | V | B || N | M | , | . | /           |/
      ------------------------------------------------------------------
      Option | LT(ARROW, 英数) | Space(Command) || LT(NUMBER,Enter) | LT(ARROW,かな) | Command＋Space(for Alfred)


# 数字レイヤー
      --------------------------------------------------------------------------
      TAB          |  [ | ] | ( | ) | ` || Del       | 7 | 8 | 9 | 0           |\
      -------------|----|---|---|---|---||-----------|---|---|---|-------------|-
      ESC(Control) |  / | * | - | + | = || Backspace | 4 | 5 | 6 | .           |
      -------------|----|---|---|---|---||-----------|---|---|---|-------------|-
      Shift        |  % | ^ | < | > | ` || &         | 1 | 2 | 3 | .           |
      ------------------------------------------------------------------
      Option | LT(ARROW, 英数) | Space(Command) || LT(NUMBER,Enter) | LT(ARROW,かな) | 0

# 移動レイヤー

      --------------------------------------------------------------------------------------------------------------------
      TAB          | Menu        | Desktop <- | App move | Desktop -> | Menubar    ||      |      | Home | End   | PageUP | PageDOWN |
      -------------|-------------|------------|----------|------------|------------||------|------|------|-------|--------|
      ESC(Control) | BrowserBack | Tab <-     | AppWindow| Tab ->     | Browser -> || Left | Down | Up   | Right |        | Enter
      -------------|-------------|------------|----------|------------|------------||------|------|------|-------|--------|
      Shift        |             |            |          |            |            ||      | _    | +    | [     | ]      | 
      ------------------------------------------------------------------
      Option | LT(ARROW, 英数) | Space(Command) || LT(NUMBER,Enter) | LT(ARROW,かな) | Command＋Space(for Alfred)

# マウス操作レイヤー

      -------------------------------------------------------------------------------------------------------------
        |             | |            |           |            || | PageUP    | MouseUP   |            |         | |
      ----------------|-|------------|-----------|------------||-|-----------|-----------|------------|---------|-|
        | BrowserBack | | RightClick | LeftClick | Browser -> || | MouseLeft | MouseDown | MouseRight |         | |
      ----------------|-|------------|-----------|------------||-|-----------|-----------|------------|---------|-|
        |             | |            |           |            || | PageDown  |           |            |         | |
      -------------------------------------------------------------------------------------------------------------
      Option | LT(ARROW, 英数) | Space(Command) || LT(NUMBER,Enter) | LT(ARROW,かな) | Command＋Space(for Alfred)

# Adjust レイヤー

      --------------------------------------------------
       | | | | | || |BrightnessDown | BrightnessUp | | |
      -|-|-|-|-|-||-|---------------|--------------|-|-|-
       | | | | | || |  VolumeDown   |   VolumeUP   | | |
      -|-|-|-|-|-||-|---------------|--------------|-|-|-
       | | | | | || |     Mute      |              | | |
      --------------------------------------------------
       | | | | | |
```


## VIM
- neovim for writing paper
- macvim for others


## PC
- Macbook pro 15 2016
- Ubuntu machine
  - cpu:
  - memory:
  - gpu:


